{
  "name": "Martin Luther King Jr.",
  "profile-image": "../frontEnd/app/src/resources/mlk-resources/king_photo_01.jpg",
  "biography-text": "Martin Luther King, Jr., (January 15, 1929-April 4, 1968) was born Michael Luther King, Jr., but later had his name changed to Martin. His grandfather began the family's long tenure as pastors of the Ebenezer Baptist Church in Atlanta, serving from 1914 to 1931; his father has served from then until the present, and from 1960 until his death Martin Luther acted as co-pastor. Martin Luther attended segregated public schools in Georgia, graduating from high school at the age of fifteen; he received the B. A. degree in 1948 from Morehouse College, a distinguished Negro institution of Atlanta from which both his father and grandfather had graduated. After three years of theological study at Crozer Theological Seminary in Pennsylvania where he was elected president of a predominantly white senior class, he was awarded the B.D. in 1951. With a fellowship won at Crozer, he enrolled in graduate studies at Boston University, completing his residence for the doctorate in 1953 and receiving the degree in 1955. In Boston he met and married Coretta Scott, a young woman of uncommon intellectual and artistic attainments. Two sons and two daughters were born into the family.",
  "friends-list": [],
  "card-feed": [
    {
      "type": "text",
      "content": "I am a very simple card. I am good at containing small bits of information. I am convenient because I require little markup to use effectively",
      "image": null,
      "video": null,
      "comments": []
    },
    {
      "type": "image",
      "content": "I am a very simple card. I am good at containing small bits of information. I am convenient because I require little markup to use effectively",
      "image": "https://www.nobelprize.org/nobel_prizes/peace/laureates/1964/king_hand_photo.jpg",
      "video": null,
      "comments": []
    },
    {
      "type": "image",
      "content": "I am a very simple card. I am good at containing small bits of information. I am convenient because I require little markup to use effectively",
      "image": "../frontEnd/app/src/resources/mlk-resources/lyndon-b-johnson-mlk.jpg",
      "video": null,
      "comments": []
    },
    {
      "type": "video",
      "content": "I am a very simple card. I am good at containing small bits of information. I am convenient because I require little markup to use effectively",
      "image": null,
      "video": "https://www.youtube.com/embed/5r98tT0j1a0",
      "comments": []
    },
    {
      "type": "text",
      "content": "Martin Luther King Jr. with friends and family arriving in Oslo, Norway, on 8 December 1964 for the Nobel Peace Prize Award Ceremony and events.",
      "image": null,
      "video": null,
      "comments": []
    }
  ]
}
